#!/usr/bin/env python3
# -*- coding: utf-8 -*-

# @Time     : 2022/7/14 18:18 
# @Author   : 0xJohsnon
# @File     : __init__.py.py
# @Usage    :

Operate = {
    1: "新增",
    2: "编辑",
    3: "删除",
    4: "开启",
    5: "关闭",
    6: "一键平仓",
    7: "一键开仓",
    8: "冻结",
    9: "解冻",
    10: "买入启动",
    11: "卖出启动",
    12: "买入暂停",
    13: "卖出暂停",
    14: "账户绑定通道",
    15: "账户解绑通道",
    16: "绑定风控模型",
    17: "解绑风控模型",
    18: "账户换绑通道",
    19: "撤单",
}

Status = {
        '0': '等待售出者冻结',
        '1': '售出者已冻结足额数量',
        '2': '购买者支付成功',
        '3': '订单超时',
        '4': '订单完成',
        '5': '订单取消',
}